Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateOpeningRectangularArcWall Property
 Creation of a Rectangular Arc Wall Opening failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateOpeningRectangularArcWall { get; }
Public Shared ReadOnly Property CannotCreateOpeningRectangularArcWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateOpeningRectangularArcWall {
	FailureDefinitionId^ get ();
}
static member CannotCreateOpeningRectangularArcWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace